<a href="https://colab.research.google.com/github/KamilBienias/data-science/blob/main/training/numpy_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **numpy**

In [1]:
# https://zadania24h.wordpress.com/2018/10/17/python-biblioteki-numpy-pandas-matplotlib/

### 1. Wygeneruj losową tablice 100 x 10, która będzie reprezentować 100 punktów w 10 wymiarowej przestrzeni. Napisz funkcję, która policzy odległość euklidesową pomiędzy każdą parą punktów, czy potrafisz zrobić to w jednej linijce, bez użycia żadnych pętli/wytworników pętli? Przypomnienie, dla dwóch wektorów xx i yy odległość euklidesową liczymy z podanego wzoru.

In [2]:
import numpy as np

# tablica o wartościach całkowitych od 0 do 4
table = np.random.randint(5, size=(100, 10))
print("table[:3] =")
print(table[:3])
list_of_distances = []
for i in range(len(table)):
    for j in range(len(table)):
        if j > i:
            distance = np.linalg.norm(table[j] - table[i])
            list_of_distances.append((i, j, distance))

print("list_of_distances[:5] =")
print(list_of_distances[:5])
print
print("Tyle jest obliczonych odległości")
print(len(list_of_distances))
print("Tyle jest obliczonych odległości (na piechotę)")
print(100*99/2)

table[:3] =
[[1 1 3 3 2 4 3 0 0 4]
 [3 4 3 1 4 0 1 1 3 4]
 [4 0 2 2 3 2 3 2 0 0]]
list_of_distances[:5] =
[(0, 1, 7.14142842854285), (0, 2, 6.082762530298219), (0, 3, 6.324555320336759), (0, 4, 5.0), (0, 5, 6.48074069840786)]
Tyle jest obliczonych odległości
4950
Tyle jest obliczonych odległości (na piechotę)
4950.0

### 2. Wypełnij 100-elementową tablicę liczbami losowymi naturalnymi z zakresu [5,15] i policz liczbę wystąpień tych liczb. Która z tych liczb najczęściej występuje w tak wygenerowanej tablicy? Wskazówka: zobacz funkcje: bincount, argmax.

In [3]:
import numpy as np

# pierwszy argiment do min (zawarty), drugi to max (bez niego), trzeci to długość listy.
# Jeśli size=(m, n) to tworzy listę m elementową, której każdy element jest listą n elementową
table2 = np.random.randint(5, 16, size=100)
print(table2)

print()
bin = np.bincount(table2)
print("bin =")
print(bin)
print("Oznacza:")
for i in range(len(bin)):
    print("Liczba", i, "występuje tyle razy:", bin[i])

print()
print("Liczba", np.argmax(bin), "powtarza się najczęściej, czyli", bin[np.argmax(bin)], "razy.")

[15  9  5  7  8 10 13  7  8  9  8 13 13 12 10 12 15  9 10 12 10 13 11 12
 13  7 13 15 12  8  8  9  5 12  6 15 10 11 14  7 11 10 15  6 13  6  6  7
 10 12 10 14  8 14  6  8 11 10 13  9 14 10  7  9  7  9 15 10 14  7 10 15
  8  7 11  7 14 15  5 13  8  9 11  5  5 13 13 10 15  7  6  8 11  7  9  6
  5  8 12  7]

bin =
[ 0  0  0  0  0  6  7 13 11  9 13  7  8 11  6  9]
Oznacza:
Liczba 0 występuje tyle razy: 0
Liczba 1 występuje tyle razy: 0
Liczba 2 występuje tyle razy: 0
Liczba 3 występuje tyle razy: 0
Liczba 4 występuje tyle razy: 0
Liczba 5 występuje tyle razy: 6
Liczba 6 występuje tyle razy: 7
Liczba 7 występuje tyle razy: 13
Liczba 8 występuje tyle razy: 11
Liczba 9 występuje tyle razy: 9
Liczba 10 występuje tyle razy: 13
Liczba 11 występuje tyle razy: 7
Liczba 12 występuje tyle razy: 8
Liczba 13 występuje tyle razy: 11
Liczba 14 występuje tyle razy: 6
Liczba 15 występuje tyle razy: 9

Liczba 7 powtarza się najczęściej, czyli 13 razy.

In [4]:
# https://brain.fuw.edu.pl/edu/index.php/PPy3/NumPy

### 3. Napisz funkcję zastap_zera(A, x), która zwraca tablicę utworzoną z tablicy A (o dowolnym kształcie) poprzez zastąpienie wszystkich elementów równych zero liczbą x. Sama tablica A powinna pozostać niezmieniona.

In [5]:
import numpy as np

A = np.array([[4, 0, 2], [0, -3, 9]])
print("A =")
print(A)

amount_of_elements = sum([len(listInA) for listInA in A])
print()
print("Liczba elementów tablicy A =", amount_of_elements)

def zastap_zera(A, x):
    # samo B = A nie tworzy kopii, bo zmieniając elementy z B zmienią się też z A
    B = np.copy(A)
    # przechodzi po numerach wierzy w B, czyli 0 i 1
    for row_number in range(len(B)):
        # w i-tym wierszu przechodzi po numerach jego elementów, czyli 0,1,2
        for column_number in range(len(B[row_number])):
            if B[row_number][column_number] == 0:
                B[row_number][column_number] = x
    return B

B = zastap_zera(A, 15)

print()
print("B =")
print(B)

print()
print("A =")
print(A)

A =
[[ 4  0  2]
 [ 0 -3  9]]

Liczba elementów tablicy A = 6

B =
[[ 4 15  2]
 [15 -3  9]]

A =
[[ 4  0  2]
 [ 0 -3  9]]

### 4. Napisz funkcję wysrodkuj(A), która modyfikuje tablicę A (o dowolnym kształcie) w taki sposób, że od każdego jej elementu odejmuje średnią arytmetyczną wszystkich elementów A.

In [6]:
import numpy as np

A = np.array([[4, 0, 2], [0, -3, 9]])
print("A =")
print(A)

print()
srednia = np.mean(A)
print("Średnia ze wszystkich elementów =", srednia)

def wysrodkuj(A):
    for row_number in range(len(A)):
        for column_number in range(len(A[row_number])):
            A[row_number][column_number] = A[row_number][column_number] - srednia
    return A

print()
print("Tablica A po odjęciu średniej od każdego jej elementu")
A = wysrodkuj(A)
print(A)

A =
[[ 4  0  2]
 [ 0 -3  9]]

Średnia ze wszystkich elementów = 2.0

Tablica A po odjęciu średniej od każdego jej elementu
[[ 2 -2  0]
 [-2 -5  7]]

### 5. Dla tablicy kwadratowej A (dowolnego rozmiaru większego niż 1) stworzyć tablicę jednowymiarową, której k-ty element to suma elementów k-tej kolumny tablicy A leżących poniżej głównej przekątnej.

In [7]:
import numpy as np

A = np.array([[5, 1, 3, 4], [2, 3, 6, 3], [7, 9, 1, 3], [8, 2, 4, 1]])
print("A =")
print(A)

sumy_kolumn = []
# przechodzi po numerach kolumn
for column_number in range(len(A)):
    suma_kolumny = 0
    # przechodzi po numerach wierszy
    for row_number in range(len(A)):
        suma_kolumny = suma_kolumny + A[row_number][column_number]
    sumy_kolumn.append(suma_kolumny)

print()
print("Sumy wszystkich kolumn")
print(sumy_kolumn) 

sumy_kolumn_pod_przekatna = []
# przechodzi po numerach kolumn
for column_number in range(len(A)):
    suma_kolumny = 0
    # przechodzi po numerach wierszy
    for row_number in range(len(A)):
        if row_number > column_number:
            suma_kolumny = suma_kolumny + A[row_number][column_number]
    sumy_kolumn_pod_przekatna.append(suma_kolumny)

print()
print("Sumy wszystkich kolumn pod przekątną")
print(sumy_kolumn_pod_przekatna)

A =
[[5 1 3 4]
 [2 3 6 3]
 [7 9 1 3]
 [8 2 4 1]]

Sumy wszystkich kolumn
[22, 15, 14, 11]

Sumy wszystkich kolumn pod przekątną
[17, 11, 4, 0]

### 6. Napisz funkcję, która w minimalnej liczbie kroków tworzy (i zwraca) kwadratową tablicę NumPy zawierającą na przemian jedynki i zera, o dowolnym - zadanym przez argument wywołania - rozmiarze, w postaci:

In [8]:
def naprzemian(size):
    A = np.zeros((size, size))
    # przechodzi przez numery wierszy od 0 do size-1
    for row_number in range(size):
        # jeśli numer wiersza jest parzysty
        if row_number % 2 == 0:
            # przechodzi przez numery elementów w wierszu row_number
            for element_number in range(size):
                # jeśli numer elementu jest parzysty
                if element_number % 2 == 0:
                    # to wstawia jedynkę
                    A[row_number][element_number] = 1
        # jeśli numer wiersza jest nieparzysty
        elif row_number % 2 == 1:
            # przechodzi przez numery elementów w wierszu row_number
            for element_number in range(size):
                # jeśli numer elementu jest nieparzysty
                if element_number % 2 == 1:
                    # to wstawia jedynkę
                    A[row_number][element_number] = 1
    return A

naprzemian(8)

array([[1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.],
       [1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.],
       [1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.],
       [1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.]])

### 7. (Moje) znajdź indeksy wyrazów równych 14

In [17]:
import numpy as np

tablica = np.array([6, 14, 54, -2, 14, 7])
indeksy = np.where(tablica == 14)
print(indeksy)
print(indeksy[0])

(array([1, 4]),)
[1 4]

# **pandas**

In [10]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Kamil", "John", "Alfred"],
    "age": [21, 42, 18],
    "height": [1.83, 1.96, 1.79],
    "weight": [101.8, 75.2, 45.5],
    "is_married": [True, False, True],
    "website": ["kamil-dash.pl", "john-django.com", 'alfred-spring.pl']
})

df

     name  age  height  weight  is_married           website
0   Kamil   21    1.83   101.8        True     kamil-dash.pl
1    John   42    1.96    75.2       False   john-django.com
2  Alfred   18    1.79    45.5        True  alfred-spring.pl

### 1. Dodaje 5 do kolumny 'age'

In [11]:
df["age_plus_5"] = df["age"].apply(lambda x: x + 5)
df

     name  age  height  weight  is_married           website  age_plus_5
0   Kamil   21    1.83   101.8        True     kamil-dash.pl          26
1    John   42    1.96    75.2       False   john-django.com          47
2  Alfred   18    1.79    45.5        True  alfred-spring.pl          23

### 2. Jeśli żonaty to w nowej kolumnie 'years_in_marriage' wpisuje jego wiek pomniejszony o 10. Jeśli singiel to 0.

In [12]:
# Jeśli żonaty to w nowej kolumnie 'years_in_marriage' wpisuje jego wiek pomniejszony o 10.
# Jeśli singiel, to wyświetli się NaN.
df["years_in_marriage"] = df["age"][df["is_married"]==True].apply(lambda x: x - 10)
# wpisanie 0 używając apply dla tych co mają False powodowało wświetlenie NaN dla pozostałych
# df["years_in_marriage"] = df["age"][df["is_married"]==False].apply(lambda x: 0)
# Zamieniam NaN na 0
df = df.fillna(value={"years_in_marriage": 0})
df

     name  age  height  ...           website  age_plus_5 years_in_marriage
0   Kamil   21    1.83  ...     kamil-dash.pl          26              11.0
1    John   42    1.96  ...   john-django.com          47               0.0
2  Alfred   18    1.79  ...  alfred-spring.pl          23               8.0

[3 rows x 8 columns]

### 3. Rozdziela adres strony od domeny

In [13]:
new_df = df["website"].str.split(".", expand=True)
df["adres"] = new_df[0]
df["domena"] = new_df[1]
df

     name  age  height  ...  years_in_marriage          adres domena
0   Kamil   21    1.83  ...               11.0     kamil-dash     pl
1    John   42    1.96  ...                0.0    john-django    com
2  Alfred   18    1.79  ...                8.0  alfred-spring     pl

[3 rows x 10 columns]

### 4. Oblicz BMI czyli masa/(wzrost^2). Jeśli < 18.5 to niedowaga, a jeśli > 25 to nadwaga.

In [14]:
import numpy as np

df['BMI'] = df['weight'] / (df['height'] * df['height'])
df["Stan_zdrowia"] = df["BMI"].apply(lambda x: "niedowaga" if x<18.5 else ("nadwaga" if x>25 else "prawidłowy"))
df[["height", "weight", "BMI", "Stan_zdrowia"]]

   height  weight        BMI Stan_zdrowia
0    1.83   101.8  30.398041      nadwaga
1    1.96    75.2  19.575177   prawidłowy
2    1.79    45.5  14.200556    niedowaga

### 5. Mając df z niektórymi polami jako None stwórz kolumnę "None_counts", w której będzie liczba wystąpień None dla każdego wiersza.

In [15]:
import pandas as pd

df = pd.DataFrame({
    "A": [4, None, 6, 8, 13],
    "B": [2, None, 5, None, 6],
    "C": [None, 7, None, 8, 9]
}, index=["wiersz1", "wiersz2", "wiersz3", "wiersz4", "wiersz5"])
print(df)

print()
df["None_counts"] = df.apply(lambda x: sum(x.isna()), axis=1)
print(df)

            A    B    C
wiersz1   4.0  2.0  NaN
wiersz2   NaN  NaN  7.0
wiersz3   6.0  5.0  NaN
wiersz4   8.0  NaN  8.0
wiersz5  13.0  6.0  9.0

            A    B    C  None_counts
wiersz1   4.0  2.0  NaN            1
wiersz2   NaN  NaN  7.0            2
wiersz3   6.0  5.0  NaN            1
wiersz4   8.0  NaN  8.0            1
wiersz5  13.0  6.0  9.0            0

### 6. Mając df z niektórymi polami jako None stwórz wiersz "srednia", w którym będzie średnia dla każdej kolumny.

In [16]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "A": [4, None, 6, 8, 13],
    "B": [2, None, 5, None, 6],
    "C": [None, 7, None, 8, 9]
}, index=["wiersz1", "wiersz2", "wiersz3", "wiersz4", "wiersz5"])
print(df)

print()
df.loc["srednia"] = df.apply(np.mean)
print(df)

            A    B    C
wiersz1   4.0  2.0  NaN
wiersz2   NaN  NaN  7.0
wiersz3   6.0  5.0  NaN
wiersz4   8.0  NaN  8.0
wiersz5  13.0  6.0  9.0

             A         B    C
wiersz1   4.00  2.000000  NaN
wiersz2    NaN       NaN  7.0
wiersz3   6.00  5.000000  NaN
wiersz4   8.00       NaN  8.0
wiersz5  13.00  6.000000  9.0
srednia   7.75  4.333333  8.0